var cityData = {
    hot: [{
        'pid': '北京',
        'pname': '北京',
        'id': '北京',
        'name': '北京'
    }, {
        'pid': '上海',
        'pname': '上海',
        'id': '上海',
        'name': '上海'
    }, {
        'pid': '广东',
        'pname': '广东',
        'id': '广州',
        'name': '广州'
    }, {
        'pid': '广东',
        'pname': '广东',
        'id': '深圳',
        'name': '深圳'
    }, {
        'pid': '江苏',
        'pname': '江苏',
        'id': '南京',
        'name': '南京'
    }, {
        'pid': '天津',
        'pname': '天津',
        'id': '天津',
        'name': '天津'
    }],
    province: [{
        id: '1',
        name: '北京',
        city: [{
            id: '2',
            name: '北京'
        }]
    }, {
        id: '21',
        name: '上海',
        city: [{
            id: '22',
            name: '上海'
        }]
    }, {
        id: '42',
        name: '天津',
        city: [{
            id: '43',
            name: '天津'
        }]
    }, {
        id: '62',
        name: '重庆',
        city: [{
            id: '63',
            name: '重庆'
        }]
    },{
        id: '1000',
        name: '福建',
        city: [{
            id: '100',
            name: '福建-其它'
        },{
            id: '101',
            name: '福州'
        },{
            id: '102',
            name: '厦门'
        },{
            id: '103',
            name: '泉州'
        },{
            id: '104',
            name: '莆田'
        },{
            id: '105',
            name: '宁德'
        },{
            id: '106',
            name: '南平'
        },{
            id: '107',
            name: '龙岩'
        },{
            id: '108',
            name: '三明'
        },{
            id: '109',
            name: '漳州'
        },]
    },{
        id: '1001',
        name: '广东',
        city: [{
            id: '200',
            name: '广东-其它'
        },{
            id: '201',
            name: '珠海'
        },{
            id: '202',
            name: '深圳'
        },{
            id: '203',
            name: '广州'
        },{
            id: '204',
            name: '东莞'
        },{
            id: '205',
            name: '佛山'
        },{
            id: '206',
            name: '中山'
        },{
            id: '207',
            name: '云浮'
        },{
            id: '208',
            name: '江门'
        },{
            id: '209',
            name: '肇庆'
        },{
            id: '2010',
            name: '潮州'
        },{
            id: '2011',
            name: '茂名'
        },{
            id: '2012',
            name: '汕尾'
        },{
            id: '2013',
            name: '惠州'
        },{
            id: '2014',
            name: '汕头'
        },{
            id: '2015',
            name: '清远'
        },{
            id: '2016',
            name: '阳江'
        },{
            id: '2017',
            name: '湛江'
        },{
            id: '2018',
            name: '河源'
        },{
            id: '2019',
            name: '韶关'
        },{
            id: '2020',
            name: '梅州'
        },{
            id: '2021',
            name: '揭阳'
        },]
    },{
        id: '1002',
        name: '香港',
        city: [{
            id: '300',
            name: '香港'
        },]
    },{
        id: '1003',
        name: '内蒙古',
        city: [{
            id: '400',
            name: '呼和浩特'
        },{
            id: '401',
            name: '锡林郭勒盟'
        },{
            id: '402',
            name: '包头'
        },{
            id: '403',
            name: '乌兰察布'
        },{
            id: '404',
            name: '阿拉善盟'
        },{
            id: '405',
            name: '巴彦淖尔'
        },{
            id: '406',
            name: '兴安盟'
        },{
            id: '407',
            name: '鄂尔多斯'
        },{
            id: '408',
            name: '乌海'
        },{
            id: '409',
            name: '呼伦贝尔'
        },{
            id: '4010',
            name: '通辽'
        },{
            id: '4011',
            name: '赤峰'
        },{
            id: '4012',
            name: '内蒙古-其它'
        },]
    },{
        id: '1004',
        name: '台湾',
        city: [{
            id: '500',
            name: '新北市'
        },{
            id: '501',
            name: '桃园市'
        },{
            id: '502',
            name: '花莲县'
        },{
            id: '503',
            name: '台北市'
        },{
            id: '504',
            name: '宜兰县'
        },{
            id: '505',
            name: '新竹市'
        },{
            id: '506',
            name: '台湾'
        },{
            id: '507',
            name: '新竹县'
        },{
            id: '508',
            name: '台中市'
        },{
            id: '509',
            name: '彰化县'
        },{
            id: '5010',
            name: '云林县'
        },{
            id: '5011',
            name: '南投县'
        },{
            id: '5012',
            name: '苗栗县'
        },{
            id: '5013',
            name: '嘉义市'
        },{
            id: '5014',
            name: '高雄市'
        },{
            id: '5015',
            name: '台南市'
        },{
            id: '5016',
            name: '嘉义县'
        },{
            id: '5017',
            name: '屏东县'
        },{
            id: '5018',
            name: '台东县'
        },{
            id: '5019',
            name: '澎湖县'
        },{
            id: '5020',
            name: '金门县'
        },{
            id: '5021',
            name: '基隆市'
        },{
            id: '5022',
            name: '连江县'
        },]
    },{
        id: '1005',
        name: '宁夏',
        city: [{
            id: '600',
            name: '宁夏-其它'
        },{
            id: '601',
            name: '银川'
        },{
            id: '602',
            name: '中卫'
        },{
            id: '603',
            name: '固原'
        },{
            id: '604',
            name: '吴忠'
        },{
            id: '605',
            name: '石嘴山'
        },]
    },{
        id: '1006',
        name: '黑龙江',
        city: [{
            id: '700',
            name: '鹤岗'
        },{
            id: '701',
            name: '牡丹江'
        },{
            id: '702',
            name: '绥化'
        },{
            id: '703',
            name: '齐齐哈尔'
        },{
            id: '704',
            name: '双鸭山'
        },{
            id: '705',
            name: '鸡西'
        },{
            id: '706',
            name: '哈尔滨'
        },{
            id: '707',
            name: '大庆'
        },{
            id: '708',
            name: '佳木斯'
        },{
            id: '709',
            name: '黑河'
        },{
            id: '7010',
            name: '七台河'
        },{
            id: '7011',
            name: '伊春'
        },{
            id: '7012',
            name: '大兴安岭地区'
        },{
            id: '7013',
            name: '黑龙江-其它'
        },]
    },{
        id: '1007',
        name: '山西',
        city: [{
            id: '800',
            name: '山西-其它'
        },{
            id: '801',
            name: '太原'
        },{
            id: '802',
            name: '长治'
        },{
            id: '803',
            name: '运城'
        },{
            id: '804',
            name: '晋中'
        },{
            id: '805',
            name: '忻州'
        },{
            id: '806',
            name: '晋城'
        },{
            id: '807',
            name: '朔州'
        },{
            id: '808',
            name: '阳泉'
        },{
            id: '809',
            name: '大同'
        },{
            id: '8010',
            name: '临汾'
        },{
            id: '8011',
            name: '吕梁'
        },]
    },{
        id: '1008',
        name: '陕西',
        city: [{
            id: '900',
            name: '西安'
        },{
            id: '901',
            name: '榆林'
        },{
            id: '902',
            name: '商洛'
        },{
            id: '903',
            name: '陕西-其它'
        },{
            id: '904',
            name: '渭南'
        },{
            id: '905',
            name: '汉中'
        },{
            id: '906',
            name: '安康'
        },{
            id: '907',
            name: '宝鸡'
        },{
            id: '908',
            name: '铜川'
        },{
            id: '909',
            name: '咸阳'
        },{
            id: '9010',
            name: '延安'
        },]
    },{
        id: '1009',
        name: '云南',
        city: [{
            id: '1000',
            name: '云南-其它'
        },{
            id: '1001',
            name: '迪庆藏族自治州'
        },{
            id: '1002',
            name: '昆明'
        },{
            id: '1003',
            name: '西双版纳傣族自治州'
        },{
            id: '1004',
            name: '曲靖'
        },{
            id: '1005',
            name: '怒江傈僳族自治州'
        },{
            id: '1006',
            name: '临沧'
        },{
            id: '1007',
            name: '昭通'
        },{
            id: '1008',
            name: '保山'
        },{
            id: '1009',
            name: '红河哈尼族彝族自治州'
        },{
            id: '10010',
            name: '玉溪'
        },{
            id: '10011',
            name: '大理白族自治州'
        },{
            id: '10012',
            name: '楚雄彝族自治州'
        },{
            id: '10013',
            name: '德宏傣族景颇族自治州'
        },{
            id: '10014',
            name: '文山壮族苗族自治州'
        },{
            id: '10015',
            name: '普洱'
        },{
            id: '10016',
            name: '丽江'
        },]
    },{
        id: '10010',
        name: '澳门',
        city: [{
            id: '1100',
            name: '澳门'
        },]
    },{
        id: '10011',
        name: '湖北',
        city: [{
            id: '1200',
            name: '武汉'
        },{
            id: '1201',
            name: '黄冈'
        },{
            id: '1202',
            name: '荆州'
        },{
            id: '1203',
            name: '宜昌'
        },{
            id: '1204',
            name: '襄阳'
        },{
            id: '1205',
            name: '孝感'
        },{
            id: '1206',
            name: '黄石'
        },{
            id: '1207',
            name: '咸宁'
        },{
            id: '1208',
            name: '恩施土家族苗族自治州'
        },{
            id: '1209',
            name: '荆门'
        },{
            id: '12010',
            name: '十堰'
        },{
            id: '12011',
            name: '鄂州'
        },{
            id: '12012',
            name: '随州'
        },{
            id: '12013',
            name: '神农架林区'
        },{
            id: '12014',
            name: '湖北-其它'
        },{
            id: '12015',
            name: '潜江'
        },{
            id: '12016',
            name: '天门'
        },{
            id: '12017',
            name: '仙桃'
        },]
    },{
        id: '10012',
        name: '河北',
        city: [{
            id: '1300',
            name: '石家庄'
        },{
            id: '1301',
            name: '河北-其它'
        },{
            id: '1302',
            name: '唐山'
        },{
            id: '1303',
            name: '保定'
        },{
            id: '1304',
            name: '邯郸'
        },{
            id: '1305',
            name: '廊坊'
        },{
            id: '1306',
            name: '秦皇岛'
        },{
            id: '1307',
            name: '沧州'
        },{
            id: '1308',
            name: '邢台'
        },{
            id: '1309',
            name: '张家口'
        },{
            id: '13010',
            name: '衡水'
        },{
            id: '13011',
            name: '承德'
        },]
    },{
        id: '10013',
        name: '山东',
        city: [{
            id: '1400',
            name: '济南'
        },{
            id: '1401',
            name: '潍坊'
        },{
            id: '1402',
            name: '德州'
        },{
            id: '1403',
            name: '青岛'
        },{
            id: '1404',
            name: '烟台'
        },{
            id: '1405',
            name: '淄博'
        },{
            id: '1406',
            name: '聊城'
        },{
            id: '1407',
            name: '临沂'
        },{
            id: '1408',
            name: '济宁'
        },{
            id: '1409',
            name: '泰安'
        },{
            id: '14010',
            name: '东营'
        },{
            id: '14011',
            name: '威海'
        },{
            id: '14012',
            name: '莱芜'
        },{
            id: '14013',
            name: '枣庄'
        },{
            id: '14014',
            name: '菏泽'
        },{
            id: '14015',
            name: '滨州'
        },{
            id: '14016',
            name: '山东-其它'
        },{
            id: '14017',
            name: '日照'
        },]
    },{
        id: '10014',
        name: '海南',
        city: [{
            id: '1500',
            name: '海南-其它'
        },{
            id: '1501',
            name: '文昌'
        },{
            id: '1502',
            name: '海口'
        },{
            id: '1503',
            name: '儋州'
        },{
            id: '1504',
            name: '万宁'
        },{
            id: '1505',
            name: '定安县'
        },{
            id: '1506',
            name: '澄迈县'
        },{
            id: '1507',
            name: '陵水黎族自治县'
        },{
            id: '1508',
            name: '琼中黎族苗族自治县'
        },{
            id: '1509',
            name: '昌江黎族自治县'
        },{
            id: '15010',
            name: '三亚'
        },{
            id: '15011',
            name: '五指山'
        },{
            id: '15012',
            name: '屯昌县'
        },{
            id: '15013',
            name: '白沙黎族自治县'
        },{
            id: '15014',
            name: '东方'
        },{
            id: '15015',
            name: '保亭黎族苗族自治县'
        },{
            id: '15016',
            name: '琼海'
        },{
            id: '15017',
            name: '乐东黎族自治县'
        },{
            id: '15018',
            name: '临高县'
        },]
    },{
        id: '10015',
        name: '浙江',
        city: [{
            id: '1600',
            name: '杭州'
        },{
            id: '1601',
            name: '温州'
        },{
            id: '1602',
            name: '浙江-其它'
        },{
            id: '1603',
            name: '宁波'
        },{
            id: '1604',
            name: '金华'
        },{
            id: '1605',
            name: '绍兴'
        },{
            id: '1606',
            name: '舟山'
        },{
            id: '1607',
            name: '台州'
        },{
            id: '1608',
            name: '丽水'
        },{
            id: '1609',
            name: '衢州'
        },{
            id: '16010',
            name: '湖州'
        },{
            id: '16011',
            name: '嘉兴'
        },]
    },{
        id: '10016',
        name: '安徽',
        city: [{
            id: '1700',
            name: '滁州'
        },{
            id: '1701',
            name: '合肥'
        },{
            id: '1702',
            name: '宿州'
        },{
            id: '1703',
            name: '铜陵'
        },{
            id: '1704',
            name: '亳州'
        },{
            id: '1705',
            name: '淮南'
        },{
            id: '1706',
            name: '黄山'
        },{
            id: '1707',
            name: '蚌埠'
        },{
            id: '1708',
            name: '六安'
        },{
            id: '1709',
            name: '宣城'
        },{
            id: '17010',
            name: '淮北'
        },{
            id: '17011',
            name: '安庆'
        },{
            id: '17012',
            name: '芜湖'
        },{
            id: '17013',
            name: '马鞍山'
        },{
            id: '17014',
            name: '池州'
        },{
            id: '17015',
            name: '阜阳'
        },{
            id: '17016',
            name: '安徽-其它'
        },]
    },{
        id: '10017',
        name: '吉林',
        city: [{
            id: '1800',
            name: '长春'
        },{
            id: '1801',
            name: '吉林市'
        },{
            id: '1802',
            name: '延边朝鲜族自治州'
        },{
            id: '1803',
            name: '四平'
        },{
            id: '1804',
            name: '白城'
        },{
            id: '1805',
            name: '辽源'
        },{
            id: '1806',
            name: '松原'
        },{
            id: '1807',
            name: '白山'
        },{
            id: '1808',
            name: '通化'
        },{
            id: '1809',
            name: '吉林-其它'
        },]
    },{
        id: '10018',
        name: '新疆',
        city: [{
            id: '1900',
            name: '和田地区'
        },{
            id: '1901',
            name: '喀什地区'
        },{
            id: '1902',
            name: '伊犁哈萨克自治州'
        },{
            id: '1903',
            name: '巴音郭楞蒙古自治州'
        },{
            id: '1904',
            name: '阿勒泰地区'
        },{
            id: '1905',
            name: '哈密'
        },{
            id: '1906',
            name: '昌吉回族自治州'
        },{
            id: '1907',
            name: '石河子'
        },{
            id: '1908',
            name: '阿克苏地区'
        },{
            id: '1909',
            name: '塔城地区'
        },{
            id: '19010',
            name: '博尔塔拉蒙古自治州'
        },{
            id: '19011',
            name: '新疆-其它'
        },{
            id: '19012',
            name: '乌鲁木齐'
        },{
            id: '19013',
            name: '克拉玛依'
        },{
            id: '19014',
            name: '克孜勒苏柯尔克孜自治州'
        },{
            id: '19015',
            name: '吐鲁番'
        },]
    },{
        id: '10019',
        name: '青海',
        city: [{
            id: '2000',
            name: '西宁'
        },{
            id: '2001',
            name: '海东'
        },{
            id: '2002',
            name: '黄南藏族自治州'
        },{
            id: '2003',
            name: '海西蒙古族藏族自治州'
        },{
            id: '2004',
            name: '海北藏族自治州'
        },{
            id: '2005',
            name: '果洛藏族自治州'
        },{
            id: '2006',
            name: '玉树藏族自治州'
        },{
            id: '2007',
            name: '海南藏族自治州'
        },{
            id: '2008',
            name: '青海-其它'
        },]
    },{
        id: '10020',
        name: '江苏',
        city: [{
            id: '2100',
            name: '南京'
        },{
            id: '2101',
            name: '常州'
        },{
            id: '2102',
            name: '江苏-其它'
        },{
            id: '2103',
            name: '苏州'
        },{
            id: '2104',
            name: '无锡'
        },{
            id: '2105',
            name: '南通'
        },{
            id: '2106',
            name: '盐城'
        },{
            id: '2107',
            name: '镇江'
        },{
            id: '2108',
            name: '淮安'
        },{
            id: '2109',
            name: '扬州'
        },{
            id: '21010',
            name: '泰州'
        },{
            id: '21011',
            name: '连云港'
        },{
            id: '21012',
            name: '宿迁'
        },{
            id: '21013',
            name: '徐州'
        },]
    },{
        id: '10021',
        name: '西藏',
        city: [{
            id: '2200',
            name: '拉萨'
        },{
            id: '2201',
            name: '昌都'
        },{
            id: '2202',
            name: '山南'
        },{
            id: '2203',
            name: '阿里地区'
        },{
            id: '2204',
            name: '林芝'
        },{
            id: '2205',
            name: '日喀则'
        },{
            id: '2206',
            name: '那曲地区'
        },{
            id: '2207',
            name: '西藏-其它'
        },]
    },{
        id: '10022',
        name: '辽宁',
        city: [{
            id: '2300',
            name: '大连'
        },{
            id: '2301',
            name: '鞍山'
        },{
            id: '2302',
            name: '沈阳'
        },{
            id: '2303',
            name: '辽宁-其它'
        },{
            id: '2304',
            name: '铁岭'
        },{
            id: '2305',
            name: '盘锦'
        },{
            id: '2306',
            name: '辽阳'
        },{
            id: '2307',
            name: '抚顺'
        },{
            id: '2308',
            name: '葫芦岛'
        },{
            id: '2309',
            name: '锦州'
        },{
            id: '23010',
            name: '朝阳'
        },{
            id: '23011',
            name: '阜新'
        },{
            id: '23012',
            name: '丹东'
        },{
            id: '23013',
            name: '营口'
        },{
            id: '23014',
            name: '本溪'
        },]
    },{
        id: '10023',
        name: '江西',
        city: [{
            id: '2400',
            name: '南昌'
        },{
            id: '2401',
            name: '江西-其它'
        },{
            id: '2402',
            name: '抚州'
        },{
            id: '2403',
            name: '萍乡'
        },{
            id: '2404',
            name: '上饶'
        },{
            id: '2405',
            name: '赣州'
        },{
            id: '2406',
            name: '宜春'
        },{
            id: '2407',
            name: '景德镇'
        },{
            id: '2408',
            name: '吉安'
        },{
            id: '2409',
            name: '九江'
        },{
            id: '24010',
            name: '新余'
        },{
            id: '24011',
            name: '鹰潭'
        },]
    },{
        id: '10024',
        name: '河南',
        city: [{
            id: '2500',
            name: '郑州'
        },{
            id: '2501',
            name: '三门峡'
        },{
            id: '2502',
            name: '安阳'
        },{
            id: '2503',
            name: '驻马店'
        },{
            id: '2504',
            name: '商丘'
        },{
            id: '2505',
            name: '新乡'
        },{
            id: '2506',
            name: '南阳'
        },{
            id: '2507',
            name: '濮阳'
        },{
            id: '2508',
            name: '周口'
        },{
            id: '2509',
            name: '洛阳'
        },{
            id: '25010',
            name: '漯河'
        },{
            id: '25011',
            name: '开封'
        },{
            id: '25012',
            name: '焦作'
        },{
            id: '25013',
            name: '信阳'
        },{
            id: '25014',
            name: '济源'
        },{
            id: '25015',
            name: '鹤壁'
        },{
            id: '25016',
            name: '平顶山'
        },{
            id: '25017',
            name: '许昌'
        },{
            id: '25018',
            name: '河南-其它'
        },]
    },{
        id: '10025',
        name: '湖南',
        city: [{
            id: '2600',
            name: '湖南-其它'
        },{
            id: '2601',
            name: '株洲'
        },{
            id: '2602',
            name: '湘潭'
        },{
            id: '2603',
            name: '衡阳'
        },{
            id: '2604',
            name: '邵阳'
        },{
            id: '2605',
            name: '岳阳'
        },{
            id: '2606',
            name: '常德'
        },{
            id: '2607',
            name: '张家界'
        },{
            id: '2608',
            name: '益阳'
        },{
            id: '2609',
            name: '郴州'
        },{
            id: '26010',
            name: '永州'
        },{
            id: '26011',
            name: '怀化'
        },{
            id: '26012',
            name: '娄底'
        },{
            id: '26013',
            name: '湘西土家族苗族自治州'
        },{
            id: '26014',
            name: '长沙'
        },]
    },{
        id: '10026',
        name: '广西',
        city: [{
            id: '2700',
            name: '南宁'
        },{
            id: '2701',
            name: '桂林'
        },{
            id: '2702',
            name: '广西-其它'
        },{
            id: '2703',
            name: '来宾'
        },{
            id: '2704',
            name: '柳州'
        },{
            id: '2705',
            name: '崇左'
        },{
            id: '2706',
            name: '玉林'
        },{
            id: '2707',
            name: '贺州'
        },{
            id: '2708',
            name: '贵港'
        },{
            id: '2709',
            name: '百色'
        },{
            id: '27010',
            name: '钦州'
        },{
            id: '27011',
            name: '梧州'
        },{
            id: '27012',
            name: '河池'
        },{
            id: '27013',
            name: '北海'
        },{
            id: '27014',
            name: '防城港'
        },]
    },{
        id: '10027',
        name: '四川',
        city: [{
            id: '2800',
            name: '成都'
        },{
            id: '2801',
            name: '四川-其它'
        },{
            id: '2802',
            name: '绵阳'
        },{
            id: '2803',
            name: '自贡'
        },{
            id: '2804',
            name: '凉山彝族自治州'
        },{
            id: '2805',
            name: '德阳'
        },{
            id: '2806',
            name: '南充'
        },{
            id: '2807',
            name: '泸州'
        },{
            id: '2808',
            name: '攀枝花'
        },{
            id: '2809',
            name: '内江'
        },{
            id: '28010',
            name: '宜宾'
        },{
            id: '28011',
            name: '乐山'
        },{
            id: '28012',
            name: '雅安'
        },{
            id: '28013',
            name: '遂宁'
        },{
            id: '28014',
            name: '达州'
        },{
            id: '28015',
            name: '巴中'
        },{
            id: '28016',
            name: '广元'
        },{
            id: '28017',
            name: '广安'
        },{
            id: '28018',
            name: '眉山'
        },{
            id: '28019',
            name: '资阳'
        },{
            id: '28020',
            name: '阿坝藏族羌族自治州'
        },{
            id: '28021',
            name: '甘孜藏族自治州'
        },]
    },{
        id: '10028',
        name: '贵州',
        city: [{
            id: '2900',
            name: '安顺'
        },{
            id: '2901',
            name: '黔南布依族苗族自治州'
        },{
            id: '2902',
            name: '铜仁'
        },{
            id: '2903',
            name: '毕节'
        },{
            id: '2904',
            name: '遵义'
        },{
            id: '2905',
            name: '黔西南布依族苗族自治州'
        },{
            id: '2906',
            name: '六盘水'
        },{
            id: '2907',
            name: '贵阳'
        },{
            id: '2908',
            name: '黔东南苗族侗族自治州'
        },{
            id: '2909',
            name: '贵州-其它'
        },]
    },{
        id: '10029',
        name: '甘肃',
        city: [{
            id: '3000',
            name: '定西'
        },{
            id: '3001',
            name: '陇南'
        },{
            id: '3002',
            name: '平凉'
        },{
            id: '3003',
            name: '天水'
        },{
            id: '3004',
            name: '甘南藏族自治州'
        },{
            id: '3005',
            name: '临夏回族自治州'
        },{
            id: '3006',
            name: '庆阳'
        },{
            id: '3007',
            name: '武威'
        },{
            id: '3008',
            name: '兰州'
        },{
            id: '3009',
            name: '金昌'
        },{
            id: '30010',
            name: '酒泉'
        },{
            id: '30011',
            name: '嘉峪关'
        },{
            id: '30012',
            name: '张掖'
        },{
            id: '30013',
            name: '白银'
        },{
            id: '30014',
            name: '甘肃-其它'
        },]
    },]};
